artillery-ultra.yml
config:
   target: "http://localhost:3000"
   http:
      timeout: 45
   defaults:
      headers:
         Authorization: "Bearer bmwTrBLr6MOkEq8gxXe1JGKmBw4bDfZ7"
   phases:
      # Gradual ramp-up to avoid immediate overload
      - duration: 30
        arrivalRate: 10
        name: "Warm up - 10 req/s"
      - duration: 60
        arrivalRate: 30
        name: "Moderate load - 30 req/s"
      - duration: 60
        arrivalRate: 50
        name: "High load - 50 req/s"
      - duration: 90
        arrivalRate: 75
        name: "Very high load - 75 req/s"
      - duration: 120
        arrivalRate: 100
        name: "Maximum stress - 100 req/s"
      - duration: 60
        arrivalRate: 150
        name: "EXTREME - 150 req/s"
      - duration: 30
        arrivalRate: 50
        name: "Cool down - 50 req/s"
   processor: "./artillery-processor.js"
   plugins:
      metrics-by-endpoint:
         useOnlyRequestNames: true
      expect:
         outputFormat: "pretty"

scenarios:
   # Initialize data from database before running any scenarios
   - name: "Initialize Database Data"
     weight: 1
     flow:
        - function: "initializeData"
   - name: "Order Creation Ultra Stress"
     weight: 70
     flow:
        - function: "generateOrderData"
        - post:
             url: "/api/v1/orders"
             headers:
                Content-Type: "application/json"
             json:
                agency_id: "{{ agency_id }}"
                user_id: "{{ user_id }}"
                customer_id: "{{ customer_id }}"
                receiver_id: "{{ receiver_id }}"
                service_id: "{{ service_id }}"
                order_items: "{{ order_items }}"
                paid_in_cents: "{{ paid_in_cents }}"
                total_in_cents: "{{ total_in_cents }}"
             expect:
                - statusCode: [200, 201]
             capture:
                - json: "$.id"
                  as: "order_id"
        - think: 0.5

   - name: "Complex Order Ultra Stress"
     weight: 30
     flow:
        - function: "generateComplexOrderData"
        - post:
             url: "/api/v1/orders"
             headers:
                Content-Type: "application/json"
             json:
                agency_id: "{{ agency_id }}"
                user_id: "{{ user_id }}"
                customer_id: "{{ customer_id }}"
                receiver_id: "{{ receiver_id }}"
                service_id: "{{ service_id }}"
                order_items: "{{ order_items }}"
             expect:
                - statusCode: [200, 201]
             capture:
                - json: "$.id"
                  as: "complex_order_id"
        - think: 1